tests/response/charge.json

{
    "response": {
        "workFlowResponse": {
            "id": 48787,
            "name": "debit creditcards (TRA)",
            "version": 0
        },
        "status": "SUCCESS",
        "message": "WorkFlow has finished successfully, for transaction Id: 8262773",
        "optionalTransactionParams": {
            "ClaveN": "ValorN",
            "Clave1": "Valor1",
            "Clave2": "Valor2"
        },
        "operationSize": 2,
        "operationsArray": [
            {
                "sortedOrder": 1,
                "status": "SUCCESS",
                "message": null,
                "payFrexTransactionId": null,
                "merchantTransactionId": "08575325",
                "paySolTransactionId": "8113c6c1-9e43-4071-ba57-d505391f6ac0",
                "operationType": "DEBIT",
                "currency": "EUR",
                "amount": "30",
                "paymentSolution": null,
                "paymentMethod": null,
                "service": "TRA",
                "redirectionResponse": null,
                "redirectionParameters": null,
                "redirectionParam": null,
                "details": null,
                "originalPayFrexTransactionId": null,
                "originalCurrency": null,
                "originalAmount": null,
                "remainingAmount": null,
                "optionalTransactionParams": null,
                "checkoutURL": null,
                "fee": null,
                "checkFields": null,
                "statusType3DS": null,
                "paymentDetails": null,
                "extraInfo": {},
                "paymentResponse": null,
                "authCode": null,
                "paymentMessage": null,
                "paymentCode": null,
                "mpi": null,
                "subscriptionPlan": null,
                "rad": null,
                "respCode": {
                    "type": "respCode",
                    "code": "8203",
                    "message": "Frictionless requires",
                    "uuid": "a9276922_1e5f_4b35_a0cc_cef93aaf71f3"
                }
            },
            {
                "sortedOrder": 2,
                "status": "REDIRECTED",
                "message": "Starting 3DSecure 2.0 process.",
                "payFrexTransactionId": null,
                "merchantTransactionId": "08575325",
                "paySolTransactionId": null,
                "operationType": "DEBIT",
                "currency": "EUR",
                "amount": "30",
                "paymentSolution": null,
                "paymentMethod": null,
                "service": "3DSv2",
                "redirectionResponse": "redirect:https://checkout.stg-eu-west3.epgint.com/EPGCheckout/rest/online/3dsv2/redirect?action=gatherdevice&params=eyJ0aHJlZURTdjJUb2tlbiI6ImM4ZGQwOTE5LWUyMTUtNDEzYi1iZjJkLTA5YzA2MDFkZTlkZCIsInRocmVlRFNNZXRob2RVcmwiOiJodHRwczovL21vY2stZHMuc3RnLWV1LXdlc3QzLmVwZ2ludC5jb20vcHVibGljL21ldGhvZC1kYXRhLyIsInRocmVlRFNNZXRob2REYXRhIjoiZXlKMGFISmxaVVJUVTJWeWRtVnlWSEpoYm5OSlJDSTZJbU00WkdRd09URTVMV1V5TVRVdE5ERXpZaTFpWmpKa0xUQTVZekEyTURGa1pUbGtaQ0lzSUNKMGFISmxaVVJUVFdWMGFHOWtUbTkwYVdacFkyRjBhVzl1VlZKTUlqb2dJbWgwZEhCek9pOHZZMmhsWTJ0dmRYUXVjM1JuTFdWMUxYZGxjM1F6TG1Wd1oybHVkQzVqYjIwdlJWQkhRMmhsWTJ0dmRYUXZZMkZzYkdKaFkyc3ZaMkYwYUdWeVJHVjJhV05sVG05MGFXWnBZMkYwYVc5dUwzQmhlWE52YkM4elpITjJNaTh4TVRFMU5qZzNJbjA9IiwiYnJhbmQiOiJWSVNBIiwicmVzdW1lQXV0aGVudGljYXRpb24iOiJodHRwczovL2NoZWNrb3V0LnN0Zy1ldS13ZXN0My5lcGdpbnQuY29tL0VQR0NoZWNrb3V0L3JldHVybnVybC9mcmljdGlvbmxlc3MvcGF5c29sLzNkc3YyLzExMTU2ODc/dGhyZWVEU3YyVG9rZW49YzhkZDA5MTktZTIxNS00MTNiLWJmMmQtMDljMDYwMWRlOWRkIiwicmVuZGVyQ2FzaGllckxvY2F0aW9uIjoiaHR0cHM6Ly9lcGdqcy1yZW5kZXJjYXNoaWVyLXN0Zy5lYXN5cGF5bWVudGdhdGV3YXkuY29tIiwiY2hhbGxlbmdlV2luZG93c1NpemUiOiIwNSJ9",
                "redirectionParameters": null,
                "redirectionParam": null,
                "details": null,
                "originalPayFrexTransactionId": null,
                "originalCurrency": null,
                "originalAmount": null,
                "remainingAmount": null,
                "optionalTransactionParams": {},
                "checkoutURL": null,
                "fee": null,
                "checkFields": null,
                "statusType3DS": null,
                "paymentDetails": {
                    "issuerCountry": null,
                    "issuerBank": null,
                    "cardHolderName": "test",
                    "cardType": null,
                    "cardNumber": null,
                    "account": null,
                    "cardNumberToken": null,
                    "expDate": null,
                    "extraDetails": {
                        "threeDSMethodData": "eyJ0aHJlZURTU2VydmVyVHJhbnNJRCI6ImM4ZGQwOTE5LWUyMTUtNDEzYi1iZjJkLTA5YzA2MDFkZTlkZCIsICJ0aHJlZURTTWV0aG9kTm90aWZpY2F0aW9uVVJMIjogImh0dHBzOi8vY2hlY2tvdXQuc3RnLWV1LXdlc3QzLmVwZ2ludC5jb20vRVBHQ2hlY2tvdXQvY2FsbGJhY2svZ2F0aGVyRGV2aWNlTm90aWZpY2F0aW9uL3BheXNvbC8zZHN2Mi8xMTE1Njg3In0=",
                        "threeDSv2Token": "c8dd0919-e215-413b-bf2d-09c0601de9dd"
                    }
                },
                "extraInfo": {},
                "paymentResponse": {
                    "status": "REDIRECTED",
                    "message": "Starting 3DSecure 2.0 process.",
                    "paySolTransactionId": null,
                    "details": null
                },
                "authCode": null,
                "paymentMessage": null,
                "paymentCode": null,
                "mpi": {
                    "txnId": null,
                    "enrolment": null,
                    "message": null,
                    "authDateTime": null,
                    "authStatus": null,
                    "cavv": null,
                    "eci": null,
                    "xid": null,
                    "cavvAlgorithm": null,
                    "status": null,
                    "result": null,
                    "acsUrl": null,
                    "creq": null,
                    "mpiHash": null,
                    "threeDSv2Token": null,
                    "threeDSSessionData": null,
                    "threeDSMethodURL": "https://mock-ds.stg-eu-west3.epgint.com/public/method-data/",
                    "acsEndProtocolVersion": "2.2.0",
                    "acsStartProtocolVersion": "2.1.0",
                    "dsEndProtocolVersion": "2.2.0",
                    "dsStartProtocolVersion": "2.1.0",
                    "acsInterface": null,
                    "acsUiTemplate": null,
                    "acsSignedContent": null,
                    "dsTransId": null,
                    "messageVersion": null,
                    "acsTransID": null,
                    "authData": null,
                    "authMethod": null,
                    "authTimestamp": null,
                    "threeDSessionData": null
                },
                "subscriptionPlan": null,
                "rad": null,
                "respCode": {
                    "type": "respCode",
                    "code": "8100",
                    "message": "Frictionless requires",
                    "uuid": "30d9ac92_1edf_4f46_87ae_319d43033c59"
                }
            }
        ]
    }
}